app/Controllers/ClientController.php

    protected function getAuthenticatedClient(): ?array
    {
        $clientId = (int) session()->get('client_id');
        $client   = $this->clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 8