app/Controllers/OperateurController.php

SELECT *
FROM `v_montants_a_envoyer`
SELECT *
FROM `autres_operateurs`
ORDER BY `nom` ASC
SELECT `prefixes_externes`.*, `autres_operateurs`.`nom` AS `operateur_nom`
FROM `prefixes_externes`
JOIN `autres_operateurs` ON `autres_operateurs`.`id` = `prefixes_externes`.`autre_operateur_id`
ORDER BY `prefixe` ASC
---
    public function dashboard()
    {
        $gains = $this->transactionModel->getGainsSplit();

        $db = \Config\Database::connect();
        $montantsAEnvoyer = $db->table('v_montants_a_envoyer')->get()->getResultArray();

        $data = [
            'gainInterne'      => $gains['gain_interne'],
            'gainExterne'      => $gains['gain_externe'],
            'clients'          => $this->clientModel->getTousAvecSolde(),
            'prefixes'         => $this->prefixeModel->listeTriee(),
            'autresOperateurs' => $this->autreOperateurModel->orderBy('nom', 'ASC')->findAll(),
            'prefixesExternes' => $this->prefixeExterneModel->select('prefixes_externes.*, autres_operateurs.nom AS operateur_nom')
                ->join('autres_operateurs', 'autres_operateurs.id = prefixes_externes.autre_operateur_id')
                ->orderBy('prefixe', 'ASC')
                ->findAll(),