app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `telephone` = '0332337192'
 LIMIT 1
---
    public function findByTelephone(string $telephone): ?array
    {
        return $this->where('telephone', $telephone)->first();

SELECT *
FROM `clients`
ORDER BY `date_creation` DESC
---
    public function getTousAvecSolde(): array
    {
        $clients = $this->orderBy('date_creation', 'DESC')->findAll();