app/Models/CommissionExterneModel.php

    public function getPourcentage(): float
    {
        $config = $this->first();
---
SELECT *
FROM `commission_externe`
 LIMIT 1