app/Models/PrefixeModel.php

    public function estAutorise(string $prefixe): bool
    {
        return $this->where('prefixe', $prefixe)->first() !== null;
---
SELECT *
FROM `prefixes`
WHERE `prefixe` = '033'
 LIMIT 1

    public function listeTriee(): array
    {
        return $this->orderBy('prefixe', 'ASC')->findAll();
---
SELECT *
FROM `prefixes`
ORDER BY `prefixe` ASC